StarGate01/Arduino_nrf51822/RBL_nRF51822/boards.txt
menu.upload_method=Upload method
menu.device_type=Device type
#menu.ram_size=RAM size

nRF51822.name=Generic nRF51822

nRF51822.upload.protocol=avr109
nRF51822.upload.maximum_size=196608
nRF51822.upload.maximum_data_size=2560
nRF51822.upload.speed=115200
nRF51822.upload.disable_flushing=true
nRF51822.upload.use_1200bps_touch=true
nRF51822.upload.wait_for_upload_port=false
nRF51822.upload.device_type=nRF51822_XXAA

nRF51822.build.mcu=cortex-m0
nRF51822.build.f_cpu=16000000
nRF51822.build.usb_product="Arduino nRF51822"
nRF51822.build.board=Generic_nRF51822
nRF51822.build.core=RBL_nRF51822
nRF51822.build.variant=Generic_nRF51822
nRF51822.build.extra_flags=-mthumb
nRF51822.build.ldscript=linker_scripts/nRF51822.ld
#use header in the sytem folder
nRF51822.build.ble_api_include="-I{build.system.path}/ble-master" "-I{build.system.path}/ble-master/ble/services" "-I{build.system.path}/ble-master/source" "-I{build.system.path}/ble-master/source/services"
nRF51822.build.nRF51822_api_include="-I{build.system.path}/ble-nrf51822-master/source" "-I{build.system.path}/ble-nrf51822-master/source/btle" "-I{build.system.path}/ble-nrf51822-master/source/btle/custom" "-I{build.system.path}/ble-nrf51822-master/source/common" "-I{build.system.path}/ble-nrf51822-master/source/nordic_sdk/components/ble/ble_radio_notification" "-I{build.system.path}/ble-nrf51822-master/source/nordic_sdk/components/ble/ble_services/ble_dfu" "-I{build.system.path}/ble-nrf51822-master/source/nordic_sdk/components/ble/common" "-I{build.system.path}/ble-nrf51822-master/source/nordic_sdk/components/ble/device_manager" "-I{build.system.path}/ble-nrf51822-master/source/nordic_sdk/components/ble/device_manager/config" "-I{build.system.path}/ble-nrf51822-master/source/nordic_sdk/components/ble/peer_manager" "-I{build.system.path}/ble-nrf51822-master/source/nordic_sdk/components/device" "-I{build.system.path}/ble-nrf51822-master/source/nordic_sdk/components/drivers_nrf/ble_flash" "-I{build.system.path}/ble-nrf51822-master/source/nordic_sdk/components/drivers_nrf/delay" "-I{build.system.path}/ble-nrf51822-master/source/nordic_sdk/components/drivers_nrf/hal" "-I{build.system.path}/ble-nrf51822-master/source/nordic_sdk/components/drivers_nrf/pstorage" "-I{build.system.path}/ble-nrf51822-master/source/nordic_sdk/components/drivers_nrf/pstorage/config" "-I{build.system.path}/ble-nrf51822-master/source/nordic_sdk/components/libraries/bootloader_dfu" "-I{build.system.path}/ble-nrf51822-master/source/nordic_sdk/components/libraries/bootloader_dfu/hci_transport" "-I{build.system.path}/ble-nrf51822-master/source/nordic_sdk/components/libraries/crc16" "-I{build.system.path}/ble-nrf51822-master/source/nordic_sdk/components/libraries/experimental_section_vars" "-I{build.system.path}/ble-nrf51822-master/source/nordic_sdk/components/libraries/fds" "-I{build.system.path}/ble-nrf51822-master/source/nordic_sdk/components/libraries/fstorage" "-I{build.system.path}/ble-nrf51822-master/source/nordic_sdk/components/libraries/hci" "-I{build.system.path}/ble-nrf51822-master/source/nordic_sdk/components/libraries/scheduler" "-I{build.system.path}/ble-nrf51822-master/source/nordic_sdk/components/libraries/timer" "-I{build.system.path}/ble-nrf51822-master/source/nordic_sdk/components/libraries/util" "-I{build.system.path}/ble-nrf51822-master/source/nordic_sdk/components/softdevice/common/softdevice_handler" "-I{build.system.path}/ble-nrf51822-master/source/nordic_sdk/components/softdevice/s130/headers"
nRF51822.build.mbed_api_include="-I{build.system.path}/mbed/api" "-I{build.system.path}/mbed/common" "-I{build.system.path}/mbed/hal" "-I{build.system.path}/mbed/targets/cmsis" "-I{build.system.path}/mbed/targets/cmsis/TARGET_NORDIC/TARGET_MCU_NRF51822/" "-I{build.system.path}/mbed/targets/hal/TARGET_NORDIC/TARGET_MCU_NRF51822" "-I{build.system.path}/mbed/targets/hal/TARGET_NORDIC/TARGET_MCU_NRF51822/TARGET_RBLAB_NRF51822"


#Upload method(s)
#Blackmagic probe
nRF51822.menu.upload_method.BMPMethod=BMP (Black Magic Probe)
nRF51822.menu.upload_method.BMPMethod.upload.protocol=gdb_bmp
nRF51822.menu.upload_method.BMPMethod.upload.tool=bmp_upload

#Jlink. 
nRF51822.menu.upload_method.JLinkMethod=JLink
nRF51822.menu.upload_method.JLinkMethod.upload.protocol=jink
nRF51822.menu.upload_method.JLinkMethod.upload.tool=jlink_upload

#device type
nRF51822.menu.device_type.type_nrf51822qfaa=nRF51822 QF AA
nRF51822.menu.device_type.type_nrf51822qfaa.build.ldscript=linker_scripts/nRF51822QFAA.ld
nRF51822.menu.device_type.type_nrf51822qfaa.upload.maximum_data_size=2560
nRF51822.menu.device_type.type_nrf51822qfaa.upload.maximum_size=196608
nRF51822.menu.device_type.type_nrf51822qfaa.upload.device_type=nRF51822_XXAA


nRF51822.menu.device_type.type_nrf51822qfac=nRF51822 QF AC
nRF51822.menu.device_type.type_nrf51822qfac.build.ldscript=linker_scripts/nRF51822QFAC.ld
nRF51822.menu.device_type.type_nrf51822qfac.upload.maximum_data_size=18994
nRF51822.menu.device_type.type_nrf51822qfac.upload.maximum_size=196608
nRF51822.menu.device_type.type_nrf51822qfaa.upload.device_type=nRF51822_XXAC


#Memory size
nRF51822.menu.ram_size.size_16k=16k (QFAA)
nRF51822.menu.ram_size.size_16k.build.ldscript=linker_scripts/nRF51822QFAA.ld
nRF51822.menu.ram_size.size_16k.upload.maximum_data_size=2560

nRF51822.menu.ram_size.size_32k=32k (QFAC)
nRF51822.menu.ram_size.size_32k.build.ldscript=linker_scripts/nRF51822QFAC.ld
nRF51822.menu.ram_size.size_32k.upload.maximum_data_size=18994


smartwatch.name=Smartwatch
smartwatch.upload.protocol=avr109
smartwatch.upload.maximum_size=196608
smartwatch.upload.maximum_data_size=2560
smartwatch.upload.speed=115200
smartwatch.upload.disable_flushing=true
smartwatch.upload.use_1200bps_touch=true
smartwatch.upload.wait_for_upload_port=false
smartwatch.upload.device_type=nRF51822_XXAA
smartwatch.build.mcu=cortex-m0
smartwatch.build.f_cpu=16000000
smartwatch.build.usb_product="Arduino nRF51822"
smartwatch.build.board=Smartwatch
smartwatch.build.core=RBL_nRF51822
smartwatch.build.variant=Smartwatch
smartwatch.build.extra_flags=-mthumb
smartwatch.build.ldscript=linker_scripts/nRF51822QFAA.ld
#use header in the sytem folder
smartwatch.build.ble_api_include="-I{build.system.path}/ble-master" "-I{build.system.path}/ble-master/ble/services" "-I{build.system.path}/ble-master/source" "-I{build.system.path}/ble-master/source/services"
smartwatch.build.nRF51822_api_include="-I{build.system.path}/ble-nrf51822-master/source" "-I{build.system.path}/ble-nrf51822-master/source/btle" "-I{build.system.path}/ble-nrf51822-master/source/btle/custom" "-I{build.system.path}/ble-nrf51822-master/source/common" "-I{build.system.path}/ble-nrf51822-master/source/nordic_sdk/components/ble/ble_radio_notification" "-I{build.system.path}/ble-nrf51822-master/source/nordic_sdk/components/ble/ble_services/ble_dfu" "-I{build.system.path}/ble-nrf51822-master/source/nordic_sdk/components/ble/common" "-I{build.system.path}/ble-nrf51822-master/source/nordic_sdk/components/ble/device_manager" "-I{build.system.path}/ble-nrf51822-master/source/nordic_sdk/components/ble/device_manager/config" "-I{build.system.path}/ble-nrf51822-master/source/nordic_sdk/components/ble/peer_manager" "-I{build.system.path}/ble-nrf51822-master/source/nordic_sdk/components/device" "-I{build.system.path}/ble-nrf51822-master/source/nordic_sdk/components/drivers_nrf/ble_flash" "-I{build.system.path}/ble-nrf51822-master/source/nordic_sdk/components/drivers_nrf/delay" "-I{build.system.path}/ble-nrf51822-master/source/nordic_sdk/components/drivers_nrf/hal" "-I{build.system.path}/ble-nrf51822-master/source/nordic_sdk/components/drivers_nrf/pstorage" "-I{build.system.path}/ble-nrf51822-master/source/nordic_sdk/components/drivers_nrf/pstorage/config" "-I{build.system.path}/ble-nrf51822-master/source/nordic_sdk/components/libraries/bootloader_dfu" "-I{build.system.path}/ble-nrf51822-master/source/nordic_sdk/components/libraries/bootloader_dfu/hci_transport" "-I{build.system.path}/ble-nrf51822-master/source/nordic_sdk/components/libraries/crc16" "-I{build.system.path}/ble-nrf51822-master/source/nordic_sdk/components/libraries/experimental_section_vars" "-I{build.system.path}/ble-nrf51822-master/source/nordic_sdk/components/libraries/fds" "-I{build.system.path}/ble-nrf51822-master/source/nordic_sdk/components/libraries/fstorage" "-I{build.system.path}/ble-nrf51822-master/source/nordic_sdk/components/libraries/hci" "-I{build.system.path}/ble-nrf51822-master/source/nordic_sdk/components/libraries/scheduler" "-I{build.system.path}/ble-nrf51822-master/source/nordic_sdk/components/libraries/timer" "-I{build.system.path}/ble-nrf51822-master/source/nordic_sdk/components/libraries/util" "-I{build.system.path}/ble-nrf51822-master/source/nordic_sdk/components/softdevice/common/softdevice_handler" "-I{build.system.path}/ble-nrf51822-master/source/nordic_sdk/components/softdevice/s130/headers"
smartwatch.build.mbed_api_include="-I{build.system.path}/mbed/api" "-I{build.system.path}/mbed/common" "-I{build.system.path}/mbed/hal" "-I{build.system.path}/mbed/targets/cmsis" "-I{build.system.path}/mbed/targets/cmsis/TARGET_NORDIC/TARGET_MCU_NRF51822/" "-I{build.system.path}/mbed/targets/hal/TARGET_NORDIC/TARGET_MCU_NRF51822" "-I{build.system.path}/mbed/targets/hal/TARGET_NORDIC/TARGET_MCU_NRF51822/TARGET_RBLAB_NRF51822"

#Upload method(s)
#Blackmagic probe
smartwatch.menu.upload_method.BMPMethod=BMP (Black Magic Probe)
smartwatch.menu.upload_method.BMPMethod.upload.protocol=gdb_bmp
smartwatch.menu.upload_method.BMPMethod.upload.tool=bmp_upload

#Jlink. 
smartwatch.menu.upload_method.JLinkMethod=JLink
smartwatch.menu.upload_method.JLinkMethod.upload.protocol=jink
smartwatch.menu.upload_method.JLinkMethod.upload.tool=jlink_upload

#Wellcore iBeacon
wellcoreibeacon.name=Wellcore iBeacon
wellcoreibeacon.upload.protocol=avr109
wellcoreibeacon.upload.maximum_size=196608
wellcoreibeacon.upload.maximum_data_size=2560
wellcoreibeacon.upload.speed=115200
wellcoreibeacon.upload.disable_flushing=true
wellcoreibeacon.upload.use_1200bps_touch=true
wellcoreibeacon.upload.wait_for_upload_port=false
wellcoreibeacon.upload.device_type=nRF51822_XXAA

